//: [Previous](@previous)
/*:
## 单元及UI测试意义及目的
 ---
 ### 测试驱动开发
 * 概念
 
   `TDD(Test-driven dev)`，基本思想就是在开发功能代码之前，先编写测试代码。也就是说在明确要开发某个功能后，首先思考如何对这个功能进行测试，并完成相应的测试用例，然后编写相关代码满足这些测试，然后循环添加这些功能，直至开发结束。
 
 * 特点
   * TDD侧重点偏向开发，开发完成即完工。传统的编码方式很难知道什么时候编码结束了，TDD模式下开发人员可以明确自己的编码工作已经结束了。
   * 代码大部分保持在高质量状态。
   * 减少文档和代码之间的差别。
 ---
 
 ### 行为驱动开发
 * 概念
 
   `BDD(Behavior-driven dev)`，是一种敏捷软件开发的技术，BDD的重点是通过与利益相关者的讨论取得对预期的软件行为的清醒认识。它通过用自然语言书写非程序员可读的测试用例扩展了测试驱动开发方法。
 
 * 特点
     * BDD更加侧重设计。
     * 测试代码是否符合客户的需求，侧重于代码的功能逻辑。
     * 避免客户和开发者在沟通上的障碍，实现客户和开发者同时定义系统的需求。
 
 ---
 
 ### 测试内容
 * 核心功能︰模型类和方法及其与控制器的交互
 * 最常见的用户界面工作流
 * 边界条件
 * 错误修复
 
 ---
 ### 测试的目的
 * 对于产品或项目
 * 对于开发者
*/

//: [Next](@next)
